# location-processor - staging
### Terraform Format and Style 🖌 `success`
### Terraform Initialization ⚙️ `success`
### Terraform Validation 🤖 `success`
### Terraform Plan 📖 `success`
<details><summary>Show Plan</summary>
```terraform

module.common_resources.module.aws_lambda_organization_v1_event.data.archive_file.default: Reading...
module.common_resources.module.database_user.random_password.password: Refreshing state... [id=none]
module.common_resources.module.aws_lambda_organization_v1_event_retry[0].data.archive_file.default: Reading...
module.common_resources.module.aws_lambda_customer_v1_event_retry[0].data.archive_file.default: Reading...
module.common_resources.module.aws_lambda_customer_v1_event.data.archive_file.default: Reading...
module.common_resources.module.aws_lambda_customer_v1_event.data.aws_iam_policy_document.lambda_role_policy_document: Reading...
module.common_resources.module.aws_lambda_organization_v1_event_retry[0].data.aws_iam_policy_document.lambda_role_policy_document: Reading...
module.common_resources.module.aws_lambda_customer_v1_event_retry[0].data.aws_iam_policy_document.lambda_role_policy_document: Reading...
module.common_resources.module.aws_lambda_customer_v1_event_retry[0].data.aws_iam_policy_document.lambda_role_policy_document: Read complete after 0s [id=3693445097]
module.common_resources.module.aws_lambda_organization_v1_event_retry[0].data.aws_iam_policy_document.lambda_role_policy_document: Read complete after 0s [id=3693445097]
module.common_resources.module.aws_lambda_customer_v1_event.data.aws_iam_policy_document.lambda_role_policy_document: Read complete after 0s [id=3693445097]
module.common_resources.module.aws_lambda_customer_v1_event.aws_cloudwatch_log_group.default: Refreshing state... [id=/aws/lambda/location_cus_v1_event]
module.common_resources.module.aws_lambda_customer_v1_event_retry[0].aws_cloudwatch_log_group.default: Refreshing state... [id=/aws/lambda/location_cus_v1_event_retry_0]
module.common_resources.data.aws_ssm_parameter.kafka_cluster_id: Reading...
module.common_resources.data.aws_ssm_parameter.kafka_topic_credential_secret_name: Reading...
module.common_resources.data.aws_ssm_parameter.kafka_cluster_credential_id: Reading...
module.common_resources.module.aws_lambda_organization_v1_event.data.aws_iam_policy_document.lambda_role_policy_document: Reading...
module.common_resources.module.aws_lambda_organization_v1_event.data.aws_iam_policy_document.lambda_role_policy_document: Read complete after 0s [id=3693445097]
module.common_resources.module.database_user.data.aws_ssm_parameter.cluster_id: Reading...
module.common_resources.data.aws_ssm_parameter.kafka_cluster_credential_id: Read complete after 0s [id=upstash_kafka_cluster_credential_id]
module.common_resources.module.database_user.data.aws_ssm_parameter.cluster_id: Read complete after 0s [id=cockroachdb_serverless_cluster_id]
module.common_resources.data.aws_ssm_parameter.kafka_cluster_id: Read complete after 0s [id=upstash_kafka_cluster_id]
module.common_resources.data.aws_ssm_parameter.kafka_topic_credential_secret_name: Read complete after 0s [id=upstash_kafka_credential_secret_name]
module.common_resources.module.aws_lambda_customer_v1_event_retry[0].aws_iam_role.lambda_role: Refreshing state... [id=le-location_cus_v1_event_retry_0]
module.common_resources.data.upstash_kafka_credential_data.default: Reading...
module.common_resources.module.database_user.data.cockroach_connection_string.default: Reading...
module.common_resources.module.aws_lambda_customer_v1_event.aws_iam_role.lambda_role: Refreshing state... [id=le-location_cus_v1_event]
module.common_resources.data.upstash_kafka_cluster_data.kafka_cluster: Reading...
module.common_resources.module.database_user.cockroach_sql_user.default: Refreshing state... [id=713821e5-fed9-4082-a0c7-406a4f9b0c57:location_processor]
module.common_resources.data.aws_secretsmanager_secret.kafka_topic_credential: Reading...
module.common_resources.module.aws_lambda_customer_v1_event_retry[0].aws_iam_role_policy_attachment.default: Refreshing state... [id=le-location_cus_v1_event_retry_0-20230619132757041200000002]
module.common_resources.module.database_user.data.cockroach_connection_string.default: Read complete after 1s
module.common_resources.module.aws_lambda_customer_v1_event.aws_iam_role_policy_attachment.default: Refreshing state... [id=le-location_cus_v1_event-20230619132756984300000001]
module.common_resources.data.aws_secretsmanager_secret.kafka_topic_credential: Read complete after 0s [id=arn:aws:secretsmanager:us-east-1:754682412926:secret:upstash_kafka_credential_191092-f5XKok]
module.common_resources.module.aws_lambda_customer_v1_event.data.aws_iam_policy_document.lambda_secrets_policy_document[0]: Reading...
module.common_resources.module.aws_lambda_customer_v1_event.data.aws_iam_policy_document.lambda_secrets_policy_document[0]: Read complete after 0s [id=213115978]
module.common_resources.module.aws_lambda_organization_v1_event_retry[0].data.aws_iam_policy_document.lambda_secrets_policy_document[0]: Reading...
module.common_resources.module.aws_lambda_organization_v1_event_retry[0].data.aws_iam_policy_document.lambda_secrets_policy_document[0]: Read complete after 0s [id=213115978]
module.common_resources.data.upstash_kafka_credential_data.default: Read complete after 1s [id=upstash-kafka-credential-42067792-8b6c-4c27-b34e-d1daed82d943]
module.common_resources.module.aws_lambda_customer_v1_event.aws_iam_role_policy.lambda_secrets_policy[0]: Refreshing state... [id=le-location_cus_v1_event:lambda-secrets-policy-location_cus_v1_event]
module.common_resources.module.aws_lambda_customer_v1_event_retry[0].data.aws_iam_policy_document.lambda_secrets_policy_document[0]: Reading...
module.common_resources.module.aws_lambda_organization_v1_event.data.aws_iam_policy_document.lambda_secrets_policy_document[0]: Reading...
module.common_resources.data.upstash_kafka_cluster_data.kafka_cluster: Read complete after 1s [id=upstash-cluster-cd2221c9-e9d6-4e4b-b87a-503beb130df1]
module.common_resources.module.aws_lambda_customer_v1_event_retry[0].data.aws_iam_policy_document.lambda_secrets_policy_document[0]: Read complete after 0s [id=213115978]
module.common_resources.module.aws_lambda_organization_v1_event.data.aws_iam_policy_document.lambda_secrets_policy_document[0]: Read complete after 0s [id=213115978]
module.common_resources.module.aws_lambda_customer_v1_event_retry[0].aws_iam_role_policy.lambda_secrets_policy[0]: Refreshing state... [id=le-location_cus_v1_event_retry_0:lambda-secrets-policy-location_cus_v1_event_retry_0]
module.common_resources.module.aws_lambda_organization_v1_event_retry[0].data.archive_file.default: Read complete after 3s [id=59c3103770f1ad79da980d4a42c9d74242282fd6]
module.common_resources.module.aws_lambda_organization_v1_event.data.archive_file.default: Read complete after 3s [id=59c3103770f1ad79da980d4a42c9d74242282fd6]
module.common_resources.module.aws_lambda_customer_v1_event.data.archive_file.default: Read complete after 3s [id=ebef3174cba8123a354d290cfdc855cb412a15de]
module.common_resources.module.aws_lambda_customer_v1_event.aws_lambda_function.default: Refreshing state... [id=location_cus_v1_event]
module.common_resources.module.aws_lambda_customer_v1_event_retry[0].data.archive_file.default: Read complete after 3s [id=ebef3174cba8123a354d290cfdc855cb412a15de]
module.common_resources.module.aws_lambda_customer_v1_event_retry[0].aws_lambda_function.default: Refreshing state... [id=location_cus_v1_event_retry_0]
module.common_resources.aws_lambda_event_source_mapping.kafka_trigger_customer_v1_event_topic: Refreshing state... [id=ed4a0a97-c6d5-4ddc-b1bf-bc0d22015c58]
module.common_resources.aws_lambda_event_source_mapping.kafka_trigger_customer_v1_event_retry_topics[0]: Refreshing state... [id=0f1f357a-0b5b-415e-9302-9e6bdc91754f]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.common_resources.aws_lambda_event_source_mapping.kafka_trigger_organization_v1_event_retry_topics[0] will be created
  + resource "aws_lambda_event_source_mapping" "kafka_trigger_organization_v1_event_retry_topics" {
      + batch_size                         = 100
      + enabled                            = true
      + function_arn                       = (known after apply)
      + function_name                      = "location_org_v1_event_retry_0"
      + id                                 = (known after apply)
      + last_modified                      = (known after apply)
      + last_processing_result             = (known after apply)
      + maximum_batching_window_in_seconds = 0
      + maximum_record_age_in_seconds      = (known after apply)
      + maximum_retry_attempts             = (known after apply)
      + parallelization_factor             = (known after apply)
      + starting_position                  = "TRIM_HORIZON"
      + state                              = (known after apply)
      + state_transition_reason            = (known after apply)
      + topics                             = [
          + "organization.v1.event.retry.0",
        ]
      + uuid                               = (known after apply)

      + self_managed_event_source {
          + endpoints = {
              + "KAFKA_BOOTSTRAP_SERVERS" = "precious-raccoon-9266-us1-kafka.upstash.io:9092"
            }
        }

      + self_managed_kafka_event_source_config {
          + consumer_group_id = "urn::connectilly::location::location-processor:organization_v1_event_retry_0"
        }

      + source_access_configuration {
          + type = "SASL_SCRAM_512_AUTH"
          + uri  = "arn:aws:secretsmanager:us-east-1:754682412926:secret:upstash_kafka_credential_191092-f5XKok"
        }
    }

  # module.common_resources.aws_lambda_event_source_mapping.kafka_trigger_organization_v1_event_topic will be created
  + resource "aws_lambda_event_source_mapping" "kafka_trigger_organization_v1_event_topic" {
      + batch_size                         = 100
      + enabled                            = true
      + function_arn                       = (known after apply)
      + function_name                      = "location_org_v1_event"
      + id                                 = (known after apply)
      + last_modified                      = (known after apply)
      + last_processing_result             = (known after apply)
      + maximum_batching_window_in_seconds = 0
      + maximum_record_age_in_seconds      = (known after apply)
      + maximum_retry_attempts             = (known after apply)
      + parallelization_factor             = (known after apply)
      + starting_position                  = "TRIM_HORIZON"
      + state                              = (known after apply)
      + state_transition_reason            = (known after apply)
      + topics                             = [
          + "organization.v1.event",
        ]
      + uuid                               = (known after apply)

      + self_managed_event_source {
          + endpoints = {
              + "KAFKA_BOOTSTRAP_SERVERS" = "precious-raccoon-9266-us1-kafka.upstash.io:9092"
            }
        }

      + self_managed_kafka_event_source_config {
          + consumer_group_id = "urn::connectilly::location::location-processor:organization_v1_event"
        }

      + source_access_configuration {
          + type = "SASL_SCRAM_512_AUTH"
          + uri  = "arn:aws:secretsmanager:us-east-1:754682412926:secret:upstash_kafka_credential_191092-f5XKok"
        }
    }

  # module.common_resources.module.aws_lambda_organization_v1_event.aws_cloudwatch_log_group.default will be created
  + resource "aws_cloudwatch_log_group" "default" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/lambda/location_org_v1_event"
      + name_prefix       = (known after apply)
      + retention_in_days = 7
      + skip_destroy      = false
      + tags              = {
          + "domain"        = "location"
          + "environment"   = "staging"
          + "resource"      = "location-processor"
          + "resource_type" = "lambda"
        }
      + tags_all          = {
          + "domain"        = "location"
          + "environment"   = "staging"
          + "resource"      = "location-processor"
          + "resource_type" = "lambda"
        }
    }

  # module.common_resources.module.aws_lambda_organization_v1_event.aws_iam_role.lambda_role will be created
  + resource "aws_iam_role" "lambda_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "le-location_org_v1_event"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + role_last_used        = (known after apply)
      + tags                  = {
          + "domain"        = "location"
          + "environment"   = "staging"
          + "resource"      = "location-processor"
          + "resource_type" = "lambda"
        }
      + tags_all              = {
          + "domain"        = "location"
          + "environment"   = "staging"
          + "resource"      = "location-processor"
          + "resource_type" = "lambda"
        }
      + unique_id             = (known after apply)
    }

  # module.common_resources.module.aws_lambda_organization_v1_event.aws_iam_role_policy.lambda_secrets_policy[0] will be created
  + resource "aws_iam_role_policy" "lambda_secrets_policy" {
      + id     = (known after apply)
      + name   = "lambda-secrets-policy-location_org_v1_event"
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "secretsmanager:GetSecretValue"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:secretsmanager:us-east-1:754682412926:secret:upstash_kafka_credential_191092-f5XKok"
                      + Sid      = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role   = (known after apply)
    }

  # module.common_resources.module.aws_lambda_organization_v1_event.aws_iam_role_policy_attachment.default will be created
  + resource "aws_iam_role_policy_attachment" "default" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole"
      + role       = "le-location_org_v1_event"
    }

  # module.common_resources.module.aws_lambda_organization_v1_event.aws_lambda_function.default will be created
  + resource "aws_lambda_function" "default" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + filename                       = "/home/runner/work/Connectilly/Connectilly/artifact/organization-v1-event/lambda.zip"
      + function_name                  = "location_org_v1_event"
      + handler                        = "main"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 256
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "go1.x"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = "tm67XRiSfoLXLO69Ltnr7lilaQa1Ndxx9FUro6FLunc="
      + source_code_size               = (known after apply)
      + tags                           = {
          + "domain"        = "location"
          + "environment"   = "staging"
          + "resource"      = "location-processor"
          + "resource_type" = "lambda"
        }
      + tags_all                       = {
          + "domain"        = "location"
          + "environment"   = "staging"
          + "resource"      = "location-processor"
          + "resource_type" = "lambda"
        }
      + timeout                        = 30
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "CONNECTILLY_APP_BASE_DOMAIN"                 = "https://new-staging.connectilly.com"
              + "CONNECTILLY_KAFKA_KAFKAGO_BOOTSTRAP_SERVERS" = "precious-raccoon-9266-us1-kafka.upstash.io:9092"
              + "CONNECTILLY_KAFKA_KAFKAGO_ENABLE_SASL"       = "true"
              + "CONNECTILLY_KAFKA_KAFKAGO_ENABLE_TLS"        = "true"
              + "CONNECTILLY_KAFKA_KAFKAGO_PASSWORD"          = "115af9d0060146689ccdfbd8a39688e2"
              + "CONNECTILLY_KAFKA_KAFKAGO_SASL_ALGORITHM"    = "sha512"
              + "CONNECTILLY_KAFKA_KAFKAGO_USERNAME"          = "cHJlY2lvdXMtcmFjY29vbi05MjY2JPUcwBKiDajJ1_PyzpCvK5iTwQi8olRl9UA"
              + "CONNECTILLY_POSTGRES_CONNECTIONSTRING"       = (sensitive value)
            }
        }
    }

  # module.common_resources.module.aws_lambda_organization_v1_event_retry[0].aws_cloudwatch_log_group.default will be created
  + resource "aws_cloudwatch_log_group" "default" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/lambda/location_org_v1_event_retry_0"
      + name_prefix       = (known after apply)
      + retention_in_days = 7
      + skip_destroy      = false
      + tags              = {
          + "domain"        = "location"
          + "environment"   = "staging"
          + "resource"      = "location-processor"
          + "resource_type" = "lambda"
        }
      + tags_all          = {
          + "domain"        = "location"
          + "environment"   = "staging"
          + "resource"      = "location-processor"
          + "resource_type" = "lambda"
        }
    }

  # module.common_resources.module.aws_lambda_organization_v1_event_retry[0].aws_iam_role.lambda_role will be created
  + resource "aws_iam_role" "lambda_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "le-location_org_v1_event_retry_0"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + role_last_used        = (known after apply)
      + tags                  = {
          + "domain"        = "location"
          + "environment"   = "staging"
          + "resource"      = "location-processor"
          + "resource_type" = "lambda"
        }
      + tags_all              = {
          + "domain"        = "location"
          + "environment"   = "staging"
          + "resource"      = "location-processor"
          + "resource_type" = "lambda"
        }
      + unique_id             = (known after apply)
    }

  # module.common_resources.module.aws_lambda_organization_v1_event_retry[0].aws_iam_role_policy.lambda_secrets_policy[0] will be created
  + resource "aws_iam_role_policy" "lambda_secrets_policy" {
      + id     = (known after apply)
      + name   = "lambda-secrets-policy-location_org_v1_event_retry_0"
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "secretsmanager:GetSecretValue"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:secretsmanager:us-east-1:754682412926:secret:upstash_kafka_credential_191092-f5XKok"
                      + Sid      = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role   = (known after apply)
    }

  # module.common_resources.module.aws_lambda_organization_v1_event_retry[0].aws_iam_role_policy_attachment.default will be created
  + resource "aws_iam_role_policy_attachment" "default" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole"
      + role       = "le-location_org_v1_event_retry_0"
    }

  # module.common_resources.module.aws_lambda_organization_v1_event_retry[0].aws_lambda_function.default will be created
  + resource "aws_lambda_function" "default" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + filename                       = "/home/runner/work/Connectilly/Connectilly/artifact/organization-v1-event/lambda.zip"
      + function_name                  = "location_org_v1_event_retry_0"
      + handler                        = "main"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 256
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "go1.x"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = "tm67XRiSfoLXLO69Ltnr7lilaQa1Ndxx9FUro6FLunc="
      + source_code_size               = (known after apply)
      + tags                           = {
          + "domain"        = "location"
          + "environment"   = "staging"
          + "resource"      = "location-processor"
          + "resource_type" = "lambda"
        }
      + tags_all                       = {
          + "domain"        = "location"
          + "environment"   = "staging"
          + "resource"      = "location-processor"
          + "resource_type" = "lambda"
        }
      + timeout                        = 30
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "CONNECTILLY_APP_BASE_DOMAIN"                 = "https://new-staging.connectilly.com"
              + "CONNECTILLY_KAFKA_KAFKAGO_BOOTSTRAP_SERVERS" = "precious-raccoon-9266-us1-kafka.upstash.io:9092"
              + "CONNECTILLY_KAFKA_KAFKAGO_ENABLE_SASL"       = "true"
              + "CONNECTILLY_KAFKA_KAFKAGO_ENABLE_TLS"        = "true"
              + "CONNECTILLY_KAFKA_KAFKAGO_PASSWORD"          = "115af9d0060146689ccdfbd8a39688e2"
              + "CONNECTILLY_KAFKA_KAFKAGO_SASL_ALGORITHM"    = "sha512"
              + "CONNECTILLY_KAFKA_KAFKAGO_USERNAME"          = "cHJlY2lvdXMtcmFjY29vbi05MjY2JPUcwBKiDajJ1_PyzpCvK5iTwQi8olRl9UA"
              + "CONNECTILLY_POSTGRES_CONNECTIONSTRING"       = (sensitive value)
            }
        }
    }

Plan: 12 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
*Pushed by: @mortezaalizadeh, Action: `pull_request`*